/*
 4.sql 의 Employee Index 가 employee_key(PK) 아님
 (company_key, employee_no)(UK) 뿐이기에 Table Access Full 으로
 밖에 접근할 수 없어 인덱스를 추가한 버전.
 */

CREATE INDEX EMPLOYEE_IX_01
    ON EMPLOYEE(DEPARTMENT_KEY, STATUS)
    TABLESPACE TSD_COMPANY_IDX
;

SELECT
    e.employee_key
,   e.employee_name
,   e.position_code
,   s.base_salary
,   s.bonus
FROM DEPARTMENT d
    ,EMPLOYEE   e
    ,SALARY     s
WHERE d.department_key = 500
  AND e.department_key = d.department_key
  AND e.status         = 'ACTIVE'
  AND s.employee_key   = e.employee_key
  AND s.end_date is NULL
;

/*******************************************************************************
PLAN_TABLE_OUTPUT
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Plan hash value: 5492242

---------------------------------------------------------------------------------------------------------
| Id  | Operation                              | Name           | Rows  | Bytes | Cost (%CPU)| Time     |
---------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT                       |                |   347 | 23596 |  1474   (0)| 00:00:01 |
|   1 |  NESTED LOOPS                          |                |   347 | 23596 |  1474   (0)| 00:00:01 |
|   2 |   NESTED LOOPS                         |                |   735 | 23596 |  1474   (0)| 00:00:01 |
|   3 |    NESTED LOOPS                        |                |   245 | 11760 |   249   (0)| 00:00:01 |
|*  4 |     INDEX UNIQUE SCAN                  | DEPARTMENT_PK  |     1 |     5 |     1   (0)| 00:00:01 |
|   5 |     TABLE ACCESS BY INDEX ROWID BATCHED| EMPLOYEE       |   245 | 10535 |   248   (0)| 00:00:01 |
|*  6 |      INDEX RANGE SCAN                  | EMPLOYEE_IX_01 |   245 |       |     2   (0)| 00:00:01 |
|*  7 |    INDEX RANGE SCAN                    | SALARY_UK      |     3 |       |     2   (0)| 00:00:01 |
|*  8 |   TABLE ACCESS BY INDEX ROWID          | SALARY         |     1 |    20 |     5   (0)| 00:00:01 |
---------------------------------------------------------------------------------------------------------

Predicate Information (identified by operation id):
---------------------------------------------------

   4 - access("D"."DEPARTMENT_KEY"=500)
   6 - access("E"."DEPARTMENT_KEY"=500 AND "E"."STATUS"='ACTIVE')
   7 - access("S"."EMPLOYEE_KEY"="E"."EMPLOYEE_KEY")
   8 - filter("S"."END_DATE" IS NULL)
*******************************************************************************/

/*
 department_key 와 함께 status 에 대한 Index 가 추가되어
 Table Access Full 을 하지 않고 Employee 인덱스로 탐색하고 필요한 칼럼들의
 대해서는 BATCHED 로 처리하고 있음을 확인하고 있다. (테이블 접근)
 */

/*
 FBI(Function Based Index) 로 Unique Scan 을 유도할 수도 있다.
 위 실행 계획에서도 UK 를 사용했지만 Unique Scan 이 아닌 이유는 Index 에
 사용된 모든 칼럼을 사용하지 않은 부분이 클 것이다.
 */
SELECT
    e.employee_key
,   e.employee_name
,   e.position_code
,   s.base_salary
,   s.bonus
FROM DEPARTMENT d
    ,EMPLOYEE   e
    ,SALARY     s
WHERE d.department_key = 500
  AND e.department_key = d.department_key
  AND e.status         = 'ACTIVE'
  AND (CASE WHEN s.end_date IS NULL THEN s.employee_key END) = e.employee_key
;

/*******************************************************************************
PLAN_TABLE_OUTPUT
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Plan hash value: 1018734024

-----------------------------------------------------------------------------------------------------------
| Id  | Operation                             | Name              | Rows  | Bytes | Cost (%CPU)| Time     |
-----------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT                      |                   |   245 | 14455 |   739   (0)| 00:00:01 |
|   1 |  NESTED LOOPS                         |                   |   245 | 14455 |   739   (0)| 00:00:01 |
|   2 |   NESTED LOOPS                        |                   |   245 | 11760 |   249   (0)| 00:00:01 |
|*  3 |    INDEX UNIQUE SCAN                  | DEPARTMENT_PK     |     1 |     5 |     1   (0)| 00:00:01 |
|   4 |    TABLE ACCESS BY INDEX ROWID BATCHED| EMPLOYEE          |   245 | 10535 |   248   (0)| 00:00:01 |
|*  5 |     INDEX RANGE SCAN                  | EMPLOYEE_IX_01    |   245 |       |     2   (0)| 00:00:01 |
|   6 |   TABLE ACCESS BY INDEX ROWID         | SALARY            |     1 |    11 |     2   (0)| 00:00:01 |
|*  7 |    INDEX UNIQUE SCAN                  | SALARY_CURRENT_UK |     1 |       |     1   (0)| 00:00:01 |
-----------------------------------------------------------------------------------------------------------

Predicate Information (identified by operation id):
---------------------------------------------------

   3 - access("D"."DEPARTMENT_KEY"=500)
   5 - access("E"."DEPARTMENT_KEY"=500 AND "E"."STATUS"='ACTIVE')
   7 - access(CASE  WHEN "END_DATE" IS NULL THEN "EMPLOYEE_KEY" END ="E"."EMPLOYEE_KEY")
       filter(CASE  WHEN "END_DATE" IS NULL THEN "EMPLOYEE_KEY" END  IS NOT NULL)
*******************************************************************************/

/*
 물론 굳이 Department 정보가 필요없다면 다음과 같이 작성하는 것도 방법이다.
 절대적인 cost 나 Cardinality 는 안 줄더라도 Bytes 는 줄일 수 있다.
 이유는 Index 접근 자체를 하지 않았기 때문이다.
*/
SELECT
    e.employee_key
,   e.employee_name
,   e.position_code
,   s.base_salary
,   s.bonus
FROM EMPLOYEE   e
    ,SALARY     s
WHERE e.department_key = 500
  AND e.status         = 'ACTIVE'
  AND (CASE WHEN s.end_date IS NULL THEN s.employee_key END) = e.employee_key
;

